# EditorInteraction Properties

---
The EditorInteraction type exposes the following members.
| Name| Description
---|---|---
| InteractionType|  The type of interaction.
Top
#### Reference
EditorInteraction Class
Autodesk.Revit.UI Namespace